---
kind: method
id: M:Autodesk.Revit.DB.ExportLineweightTable.Dispose
source: html/bc849ee4-bb4f-1d65-b737-3b051f6b4cb3.htm
---
# Autodesk.Revit.DB.ExportLineweightTable.Dispose Method

Releases all resources used by the ExportLineweightTable

## Syntax (C#)
```csharp
public void Dispose()
```